network-tests/v1/oha-results/s3-bucket/istio-service-mesh-poc-vm-tests/test-vm-podinfo-ha-16-500.txt
Started at 2024-03-21-11-28
Summary:
  Success rate:	100.00%
  Total:	180.0008 secs
  Slowest:	0.0511 secs
  Fastest:	0.0038 secs
  Average:	0.0073 secs
  Requests/sec:	499.9977

  Total data:	6.87 MiB
  Size/request:	80
  Size/sec:	39.06 KiB

Response time histogram:
  0.004 [1]     |
  0.009 [77894] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.013 [10475] |■■■■
  0.018 [800]   |
  0.023 [343]   |
  0.027 [179]   |
  0.032 [125]   |
  0.037 [86]    |
  0.042 [51]    |
  0.046 [32]    |
  0.051 [10]    |

Response time distribution:
  10.00% in 0.0047 secs
  25.00% in 0.0058 secs
  50.00% in 0.0073 secs
  75.00% in 0.0080 secs
  90.00% in 0.0089 secs
  95.00% in 0.0096 secs
  99.00% in 0.0175 secs
  99.90% in 0.0372 secs
  99.99% in 0.0469 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0039 secs, 0.0021 secs, 0.0274 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs

Status code distribution:
  [200] 89996 responses

Error distribution:
  [4] aborted due to deadline
Finished at 2024-03-21-11-31